app/controllers/line_items_controller.rb

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
UPDATE "line_items" SET "updated_at" = ?, "quantity" = ? WHERE "line_items"."id" = ?  [["updated_at", "2024-09-06 09:37:12.160008"], ["quantity", 2], ["id", 1]]
INSERT INTO "line_items" ("cart_id", "created_at", "updated_at", "product_id") VALUES (?, ?, ?, ?)  [["cart_id", 18], ["created_at", "2024-09-06 14:47:45.434788"], ["updated_at", "2024-09-06 14:47:45.434788"], ["product_id", 9]]
---
  def create
    product = Product.find(params[:product_id])
    @line_item = @cart.add_product(product)

    Rails.logger.debug "Line item created: #{@line_item.inspect}"
    Rails.logger.debug "Line item id: #{@line_item.id}"

    respond_to do |format|
      if @line_item.save

SELECT "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT ?  [["id", 23], ["LIMIT", 1]]
DELETE FROM "line_items" WHERE "line_items"."id" = ?  [["id", 22]]
---
  def destroy
    @cart = Cart.find(session[:cart_id])
    @line_item.destroy